[
    {
      "nombre": "El senor de los anillos",
      "descripcion": "La novela narra el viaje del protagonista principal, Frodo Bolsón, hobbit de la Comarca, para destruir el Anillo Único y la consiguiente guerra que provocará el enemigo para recuperarlo, ya que es la principal fuente de poder de su creador, el Señor oscuro, Sauron.",
      "codigo": "1",
      "foto": "https://planetadelibroscom.cdnstatics2.com/usuaris/libros/fotos/210/m_libros/portada_el-senor-de-los-anillos_j-r-r-tolkien_201601252224.jpg",
      "precio": "120",
      "stock": "150",     
      "timestamp": 1643436289881
    },
    {      
      "timestamp": 1642908763521,
      "nombre": "El patron Bitcoin",
      "descripcion": "El patrón Bitcoin analiza el contexto histórico del surgimiento de esta nueva moneda, las propiedades económicas que la han permitido crecer rápidamente y sus implicaciones económicas, políticas y sociales.",
      "codigo": "2",
      "foto": "https://planetadelibroscom.cdnstatics2.com/usuaris/libros/fotos/344/m_libros/portada_el-patron-bitcoin_saifedean-ammous_202111181133.jpg",
      "precio": "300",
      "stock": "30"
    },
    {
      "nombre": "Padre Rico, Padre Pobre",
      "descripcion": "El libro está basado en la educación financiera que Kiyosaki recibió de su \"Padre Rico\" en Hawái, aunque el grado de ficción de estas anécdotas está en discusión. El libro remarca las diferentes actitudes hacia el dinero, el trabajo y la vida de estos dos y como ellos tuvieron influencia en la vida de ambos.",
      "codigo": "3",
      "foto": "https://imagessl5.casadellibro.com/a/l/t7/25/9788466332125.jpg",
      "precio": "1259",
      "stock": "10",     
      "timestamp": 1642909659834
    },
    {
      "timestamp": 1642908763521,
      "nombre": "Los Cuatro Acuerdos",
      "descripcion": "El doctor Miguel Ruiz nos propone en este libro un sencillo procedimiento para eliminar todas aquellas creencias heredadas que nos limitan y substituirlas por otras que responden a nuestra realidad interior y nos conducen a la libertad.",
      "codigo": "4",
      "foto": "https://imagessl6.casadellibro.com/a/l/t7/36/9788479532536.jpg",
      "precio": "1750",
      "stock": "20"
    },
    {
      "nombre": "Aquelarre (The Coven)",
      "descripcion": "Un desafiante y provocador thriller feminista al estilo El cuento de la criada.  Imagina un mundo en el que la brujería es real. En el que las madres transmiten su poder a sus hijas, un poder que utilizan de forma pacífica. Ahora imagina que el presidente de los Estados Unidos es un demagogo populista que ha decidido que todas las brujas deben permanecer encerradas, creando un mundo en el que ser mujer está solo a un paso de ser una criminal…",
      "codigo": "5",
      "foto": "https://planetadelibrosar4.cdnstatics.com/usuaris/libros/fotos/344/m_libros/343670_portada_the-coven__202012021206.jpg",
      "precio": "2760",
      "stock": "100",      
      "timestamp": 1642909280193
    },
    {
      "nombre": "Crónicas marcianas",
      "descripcion": "Recopilación de relatos que recogen la crónica de la colonización de Marte por parte de una humanidad que huye de un mundo al borde de la destrucción. Los colonos llevan consigo sus deseos más íntimos y el sueño de reproducir en el Planeta Rojo una civilización de perritos calientes, cómodos sofás y limonada en el porche al atardecer. Pero su equipaje incluye también los miedos ancestrales, que se traducen en odio a lo diferente, y las enfermedades que diezmarán a los marcianos. ",
      "codigo": "6",
      "foto": "https://planetadelibrosar1.cdnstatics.com/usuaris/libros/fotos/311/m_libros/310692_portada_cronicas-marcianas_ray-bradbury_201906251540.jpg",
      "precio": "230",
      "stock": "50",
      "timestamp": 1642909588263
    },
    {
      "nombre": "Star Wars: El renacer de la Resistencia(novela Episodio IX)",
      "descripcion": "La Resistencia está en ruinas. Tras su huida desesperada de Crait, su antiguo ejército ha quedado reducido a un puñado de héroes heridos. Finn, Poe, Rey, Rose, Chewbacca, Leia Organa… sus nombres son célebres en los mundos oprimidos por cuya libertad combaten. Pero los nombres no sirven de mucho y la última llamada de auxilio de Leia no encuentra respuesta. Desde las junglas de Ryloth hasta los astilleros de Corellia, la sombra de la Primera Orden se extiende y los valientes capaces de enfrentarse a su oscuridad están dispersos y aislados. Si la esperanza debe sobrevivir, la Resistencia tendrá que viajar por toda la galaxia, en busca de más líderes… incluidos aquellos que, en el pasado, ayudaron a una floreciente rebelión a derrocar al Imperio. Se librarán batallas, se forjarán alianzas y la Resistencia renacerá.",
      "codigo": "7",
      "foto": "https://planetadelibrosar0.cdnstatics.com/usuaris/libros/fotos/310/m_libros/portada_star-wars-el-renacer-de-la-resistencianovela-episodio-ix_rebecca-roanhorse_202002111913.jpg",
      "precio": "1340",
      "stock": "20",
      "timestamp": 1642909647306      
    },
    {
      "nombre": "Beren y Lúthien",
      "descripcion": "El elemento central del relato es el destino que ensombrece el amor de Beren y Lúthien, dado que Beren era un hombre mortal y Lúthien una elfa inmortal, cuyo padre, un gran señor elfo, en clara oposición a Beren, impuso a éste una tarea imposible que debía llevar a cabo si quería desposar a Lúthien. Éste es el núcleo de la leyenda, que acaba conduciendo al absolutamente heroico intento de Beren y Lúthien de robarle un Silmaril al más malvado de todos los seres: Melkor, también llamado Morgoth, el Enemigo Oscuro.",
      "codigo": "8",
      "foto": "https://planetadelibrosar9.cdnstatics.com/usuaris/libros/fotos/289/m_libros/portada_beren-y-luthien_j-r-r-tolkien_201901241705.jpg",
      "precio": "3000",
      "stock": "150",
      "timestamp": 1642909812930      
    },
    {
      "nombre": "Una magia más oscura",
      "descripcion": "Kell es uno de los últimos magos viajeros con una extraña habilidad para viajar entre universos paralelos conectados por una ciudad mágica. Existe un Londres Gris, sin magia y con un rey loco: el rey George III. Un Londres Rojo, donde se honra la vida y la magia y donde Kell creció junto a Rhy Maresh, heredera de un imperio esplendoroso. Un Londres Blanco, donde la lucha por controlar la magia dejó una ciudad en ruinas. Y mucho tiempo atrás, había un Londres Negro. Pero ya nadie habla de eso. Oficialmente, Kell es el viajero Rojo, embajador del imperio de Maresh y responsable de circular la correspondencia entre los nobles de cada Londres. Extraoficialmente, es un contrabandista, al servicio de quienes estén dispuestos a pagar por objetos de mundos que jamás verán. Se trata de un hobby con consecuencias mortales, que ahora sufre en primera persona.",
      "codigo": "9",
      "foto": "https://planetadelibrosar7.cdnstatics.com/usuaris/libros/fotos/247/m_libros/portada_una-magia-mas-oscura_ve-schwab_201810252246.jpg",
      "precio": "500",
      "stock": "70",
      "timestamp": 1642909887269      
    },
    {
      "nombre": "El silmarillion ilustrado",
      "descripcion": "El Silmarillion cuenta la historia de la Primera Edad, el antiguo drama del que hablan los personajes de El Señor de los Anillos, y en cuyos acontecimientos algunos de ellos tomaron parte, como Elrond y Galadriel.  Los tres Silmarils eran gemas creadas por Fëanor, el más dotado de los Elfos, y contenían la Luz de los Dos Árboles de Valinor antes de que los Árboles mismos fueran destruidos por Morgoth, el primer Señor Oscuro. Desde entonces la inmaculada Luz de Valinor vivió sólo en los Silmarils, pero Morgoth se apoderó de ellos, y los engarzó en su corona, guardada en la fortaleza impenetrable de Angband en el norte de la Tierra Media.",
      "codigo": "10",
      "foto": "https://planetadelibrosar6.cdnstatics.com/usuaris/libros/fotos/126/m_libros/125233_portada_el-silmarillion-ilustrado-por-ted-nasmith_j-r-r-tolkien_201505211338.jpg",
      "precio": "4700",
      "stock": "90",
      "timestamp": 1642909974137      
    }
  ]